{
  "plugins": {
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip"
    },
    "SchemaStore.nvim": {
      "src": "https://github.com/b0o/SchemaStore.nvim"
    },
    "auto-session": {
      "src": "https://github.com/rmagatti/auto-session"
    },
    "blink.cmp": {
      "src": "https://github.com/Saghen/blink.cmp"
    },
    "codesnap.nvim": {
      "src": "https://github.com/mistricky/codesnap.nvim"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "dial.nvim": {
      "src": "https://github.com/monaqa/dial.nvim"
    },
    "diffview.nvim": {
      "src": "https://github.com/sindrets/diffview.nvim"
    },
    "flash.nvim": {
      "src": "https://github.com/folke/flash.nvim"
    },
    "fyler.nvim": {
      "src": "https://github.com/A7Lavinraj/fyler.nvim"
    },
    "gitlinker.nvim": {
      "src": "https://github.com/linrongbin16/gitlinker.nvim"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "grug-far.nvim": {
      "src": "https://github.com/MagicDuck/grug-far.nvim"
    },
    "harpoon": {
      "src": "https://github.com/ThePrimeagen/harpoon"
    },
    "hop.nvim": {
      "src": "https://github.com/smoka7/hop.nvim"
    },
    "kulala.nvim": {
      "src": "https://github.com/mistweaverco/kulala.nvim"
    },
    "lazydev.nvim": {
      "src": "https://github.com/folke/lazydev.nvim"
    },
    "mini.move": {
      "src": "https://github.com/echasnovski/mini.move"
    },
    "neoscroll.nvim": {
      "src": "https://github.com/karb94/neoscroll.nvim"
    },
    "noice.nvim": {
      "src": "https://github.com/folke/noice.nvim"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "nvim": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "nvim-autopairs": {
      "src": "https://github.com/windwp/nvim-autopairs"
    },
    "nvim-colorizer.lua": {
      "src": "https://github.com/norcalli/nvim-colorizer.lua"
    },
    "nvim-comment-frame": {
      "src": "https://github.com/s1n7ax/nvim-comment-frame"
    },
    "nvim-lint": {
      "src": "https://github.com/mfussenegger/nvim-lint"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-snips": {
      "src": "https://github.com/s1n7ax/nvim-snips"
    },
    "nvim-spider": {
      "src": "https://github.com/chrisgrieser/nvim-spider"
    },
    "nvim-terminal": {
      "src": "https://github.com/s1n7ax/nvim-terminal"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects"
    },
    "nvim-ts-utils": {
      "src": "https://github.com/s1n7ax/nvim-ts-utils"
    },
    "nvim-ufo": {
      "src": "https://github.com/kevinhwang91/nvim-ufo"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "overseer.nvim": {
      "src": "https://github.com/stevearc/overseer.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "promise-async": {
      "src": "https://github.com/kevinhwang91/promise-async"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim"
    },
    "supermaven-nvim": {
      "src": "https://github.com/supermaven-inc/supermaven-nvim"
    },
    "timber.nvim": {
      "src": "https://github.com/Goose97/timber.nvim"
    },
    "tokyonight.nvim": {
      "src": "https://github.com/folke/tokyonight.nvim"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim"
    },
    "winshift.nvim": {
      "src": "https://github.com/sindrets/winshift.nvim"
    }
  }
}